// Git - система конроля версий. Она позволяет отслеживать изменения в файлах (написали код неделю назад и хотим посмотреть), работать над одним проектом нескольким разработчикам.
// Github - облачное хранилище проектов (онлайн-хостиг репозиториев / репозиторий - хранилище данных, в проектах - это файлы). Пощволяет размещать проекты в облачном хранилище, делиться написаным кодом с другими разработчиками, ограничивать доступ к проекту (репозиторию)

// первый способ инициализировать проект: через Github
// второй способ: в консоли через init

// git config - чтобы настроить праивльно наш репозиторий нужны два параметра: user.name, user.email
// чтобы задать новое значение git config user.name "Natalia Nesterenko"
// команда git config очень важна, потому что любые изменения, которые мы делаем в git-репозитории они привязаны к имени и емейлу, это позволяет отслеживать какой разработчик какое изменение сделал. поэтому ОБЯЗАТЕЛЬНО перед началом разработки проверять, что хранится в user.name и user.email

console.log("Hello World!")
console.error("Error")
